ellensp/framework-arduino-lpc5528/system/lpc5528/usb_cdc.c
    usb0_clock_init();

    s_cdcVcom.speed        = USB_SPEED_FULL;
    s_cdcVcom.attach       = 0;
    s_cdcVcom.cdcAcmHandle = (class_handle_t)NULL;
    s_cdcVcom.deviceHandle = NULL;

    if (kStatus_USB_Success != USB_DeviceClassInit(CONTROLLER_ID, &s_cdcAcmConfigList, &s_cdcVcom.deviceHandle))
    {
        usb_echo("USB device init failed\r\n");
    }
    else
    {
        usb_echo("USB device CDC virtual com demo\r\n");
        s_cdcVcom.cdcAcmHandle = s_cdcAcmConfigList.config->classHandle;
    }

    USB_DeviceIsrEnable();

    /*Add one delay here to make the DP pull down long enough to allow host to detect the previous disconnection.*/
    SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    USB_DeviceRun(s_cdcVcom.deviceHandle);
}

// void usb0_cdc_task(void)
// {
// 	usb_status_t error = kStatus_USB_Error;
//     if ((1 == s_cdcVcom.attach) && (1 == s_cdcVcom.startTransactions))
//     {
        /* User Code */
        /* endpoint callback length is USB_CANCELLED_TRANSFER_LENGTH (0xFFFFFFFFU) when transfer is canceled */
        // if ((0 != s_recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != s_recvSize))
        // {
            // int32_t i;

            // /* Copy Buffer to Send Buff */
            // for (i = 0; i < s_recvSize; i++)
            // {
            //     s_currSendBuf[s_sendSize++] = s_currRecvBuf[i];
            // }
            // s_recvSize = 0;
        // }

        // if (s_sendSize)
        // {
            // uint32_t size = s_sendSize;
            // s_sendSize    = 0;

            // error = USB_DeviceCdcAcmSend(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_IN_ENDPOINT, s_currSendBuf, size);

            // if (error != kStatus_USB_Success)
            // {
            //     /* Failure to send Data Handling code here */
            // }
        // }
//     }
// }